#+TITLE: R2' 
* Input

#+NAME: r2p-dt
/Volumes/Phillips/mMR_PETDA/scripts/r2pvox/r2primeMap_datatable.txt

Pulling R2Prime derivatives from a data table last modified src_bash[:exports results :var dt=r2p-dt]{stat -c "%y" $dt} {{{results(=2024-07-18 14:54:40.000000000 -0400=)}}}
 with ~InputFile~ column pointing to ~213~ ~1mm iso~ 3D MNI images.
#+begin_src bash :export results :results verbatim :var dt=r2p-dt
  sed '2q' $dt
#+end_src

#+RESULTS:
: Subj	age	invage	sex	InputFile
: 10195	22.1190965092402	0.0452098031934646	M	../../subjs/10195_20160317/r2prime/r2primeMap_MNI152_T1_2009c_al.nii.gz


#+begin_src bash :dir /Volumes/Phillips/mMR_PETDA/scripts/r2pvox/ :async :export both
cut -f 5 r2primeMap_datatable.txt |sed 1d| parallel -X -J 5  3dinfo -ad3 -n4|sort |uniq -c
#+end_src

#+RESULTS:
| 213 1.000000 | 1.0 | 1.0 | 193 | 229 | 193 | 1 |

** Matching atlas
The EPI BOLD derivatives are 2.3 iso.
The atlas is (lazily) **up-sampled** rather than recombining original inputs to match.
( <2024-11-02 Sat> [[file:../../atlases/Makefile]] )

#+begin_src bash :exports both
  3dinfo -ad3 -n4 -iname \
    ../../atlases/atlas-VentCCCaudPutPalAcc_res-{func,r2p}.nii.gz
#+end_src

#+RESULTS:
| 2.3 | 2.3 | 2.3 |  84 | 100 |  84 | 1 | ../../atlases/atlas-VentCCCaudPutPalAcc_res-func.nii.gz |
| 1.0 | 1.0 | 1.0 | 193 | 229 | 193 | 1 | ../../atlases/atlas-VentCCCaudPutPalAcc_res-r2p.nii.gz  |

* Outputs
[[file:./01_roistats.bash]] uses lncdtool ~3dmaskave_grp~ to crate [[file:../../stats/r2p_CaudPutPalAcc.csv]]

#+begin_src R :exports both :colnames yes :session
#library(dplyr)
d <- read.csv('../../stats/r2p_CaudPutPalAcc.csv')
d |>
    select("roi","nzmean","nzvoxels","nzsigma") |>
    group_by(roi) |>
    summarise(n=n(),across(where(is.numeric), list(mean=mean, sd=sd))) |>
    mutate(across(where(is.numeric), \(x) round(x,2)))
#+end_src

#+RESULTS:
| roi            |   n | nzmean_mean | nzmean_sd | nzvoxels_mean | nzvoxels_sd | nzsigma_mean | nzsigma_sd | n_mean | n_sd |
|----------------+-----+-------------+-----------+---------------+-------------+--------------+------------+--------+------|
| CC             | 213 |       13.46 |      1.44 |      13381.89 |       91.21 |         4.46 |       0.95 |    213 |      |
| LeftAccumbens  | 213 |       11.31 |      3.53 |        584.93 |       25.23 |         2.53 |       1.37 |    213 |      |
| LeftCaudate    | 213 |        9.42 |      1.55 |       3858.29 |      172.26 |          2.7 |        0.8 |    213 |      |
| LeftPallidum   | 213 |       17.64 |      2.65 |        2206.4 |        5.12 |         3.92 |       1.23 |    213 |      |
| LeftPutamen    | 213 |       10.42 |      1.53 |       6088.09 |       114.6 |         2.29 |       0.74 |    213 |      |
| RightAccumbens | 213 |       13.17 |      4.59 |           517 |       12.58 |         2.59 |       1.58 |    213 |      |
| RightCaudate   | 213 |        9.79 |      1.63 |       3732.19 |      100.02 |         2.75 |       0.71 |    213 |      |
| RightPallidum  | 213 |       17.88 |      2.49 |       2158.73 |        3.12 |            4 |       1.13 |    213 |      |
| RightPutamen   | 213 |       10.34 |      1.56 |       6344.82 |       87.03 |         2.25 |       0.68 |    213 |      |
| ventricles     | 213 |        6.11 |         2 |       5392.97 |     1063.09 |         4.24 |       0.99 |    213 |      |
